In [1]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine("mysql+pymysql://root:@localhost:3306/stock")
const = engine.connect()
engine = create_engine("sqlite:///c:\\ruby\\portlt\\db\\development.sqlite3")
conlt = engine.connect()
engine = create_engine("sqlite:///c:\\ruby\\portmy\\db\\development.sqlite3")
conmy = engine.connect()
engine = create_engine(
    "postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development")
conpg = engine.connect()

In [2]:
names = """
III SABUY
""".split()
in_p = ", ".join(map(lambda name: "'%s'" % name, names))
in_p

"'III', 'SABUY'"

### MySQL Stock Database

In [3]:
sql = '''
SELECT * FROM nameall 
WHERE name IN (%s)'''
sql = sql % in_p
nameall = pd.read_sql(sql, const)
nameall

Empty DataFrame
Columns: [name]
Index: []

In [4]:
rcds = names

In [5]:
for rcd in rcds:
    print(rcd)

III
SABUY

In [6]:
for rcd in rcds:
    const.execute("""INSERT INTO nameall (name) \
VALUES(%s)""", rcd)

In [7]:
sql = '''
SELECT * FROM nameall WHERE name IN (%s)'''
sql = sql % in_p
nameall = pd.read_sql(sql, const)
nameall

    name
0    III
1  SABUY

In [8]:
sql = '''
SELECT DISTINCT category FROM stockname ORDER BY CATEGORY'''
df_tmp = pd.read_sql(sql, const)
df_tmp

  category
0     None
1
2   CONMAT
3      MAI
4    MEDIA
5      SET
6   SET100
7    SET50
8    TRANS
9  WARRANT

In [9]:
sql = '''
SELECT * FROM stockname WHERE name IN (%s)'''
sql = sql % in_p
stockname = pd.read_sql(sql, const)
stockname

Empty DataFrame
Columns: [name, category, sector, inport, onwatch, hd, top100]
Index: []

In [10]:
sql = '''
SELECT DISTINCT sector FROM stockname ORDER BY sector'''
df_tmp = pd.read_sql(sql, const)
df_tmp

     sector
0
1      AGRI
2      AUTO
3      BANK
4      COMM
5    CONMAT
6    CONSER
7     ENERG
8     ETRON
9   FASHION
10      FIN
11     FOOD
12    HELTH
13     HOME
14      ICT
15      IMM
16    INSUR
17      MAI
18    MEDIA
19    PAPER
20   PERSON
21    PETRO
22    PFUND
23      PKG
24     PROP
25    STEEL
26  TOURISM
27    TRANS

In [13]:
name = 'SABUY'
sql = '''
INSERT INTO stockname
VALUES("%s","COMM","",0,0,0,1)'''
sql = sql % name
print(sql)

INSERT INTO stockname
VALUES("SABUY","COMM","",0,0,0,1)

In [14]:
rp = const.execute(sql)
rp.rowcount

1

In [15]:
sql = '''
SELECT * FROM stockname'''
stockname = pd.read_sql(sql, const)
stockname.shape

(282, 7)

### Add records from stockname to nameall

In [16]:
sql = '''
SELECT * 
FROM nameall
ORDER BY name'''
nameall = pd.read_sql(sql, const)
nameall.shape

(282, 1)

In [17]:
pd.set_option('max_rows',None)
sql = '''
SELECT * 
FROM stockname 
ORDER BY name'''
stockname = pd.read_sql(sql, const)
stockname.shape

(282, 7)

In [18]:
sql = """
SELECT * 
FROM nameall
WHERE name NOT IN
(SELECT name FROM stockname)"""
df_diff = pd.read_sql(sql, const)
df_diff

Empty DataFrame
Columns: [name]
Index: []

In [18]:
sqlDel = """
DELETE 
FROM nameall
WHERE name NOT IN
(SELECT name FROM stockname)"""
rp = const.execute(sqlDel)
rp.rowcount

0

In [19]:
sql = """
SELECT * 
FROM stockname
WHERE name NOT IN
(SELECT name FROM nameall)"""
df_diff = pd.read_sql(sql, const)
df_diff

Empty DataFrame
Columns: [name, category, sector, inport, onwatch, hd, top100]
Index: []

### PortPg database

In [20]:
sql = '''
SELECT *
FROM tickers
WHERE name IN (%s)'''
sql = sql % in_p
df_tmp = pd.read_sql(sql, conpg)
df_tmp

,id,name,full_name,sector,subsector,market,website,created_at,updated_at
0,700,SABUY,SABUY TECHNOLOGY PUBLIC COMPANY LIMITED,Services,Commerce,SET,www.sabuytechnology.com,2021-06-03 02:58:40.318755,2022-01-15 03:54:48.483435
1,226,III,TRIPLE I LOGISTICS PUBLIC COMPANY LIMITED,Services,Transportation & Logistics,sSET,www.iii-logistics.com,2018-04-22 04:29:37.514550,2018-07-04 15:30:19.107569

In [21]:
sql = '''
SELECT *
FROM stocks
WHERE name IN (%s)'''
sql = sql % in_p
df_tmp = pd.read_sql(sql, conpg)
df_tmp

Empty DataFrame
Columns: [id, name, market, price, max_price, min_price, pe, pbv, paid_up, market_cap, daily_volume, beta, ticker_id, created_at, updated_at]
Index: []

### Delete from exempts to be able to input financial results

In [22]:
sql = '''
SELECT * FROM exempts
WHERE name IN (%s)'''
sql = sql % in_p
df_tmp = pd.read_sql(sql, conlt)
df_tmp

Empty DataFrame
Columns: [id, name]
Index: []

In [23]:
sql = '''
DELETE FROM exempts
WHERE name IN (%s)'''
sql = sql % in_p
print(sql)

DELETE FROM exempts
WHERE name IN ('III', 'SABUY')

In [24]:
rp = conlt.execute(sql)
rp.rowcount

0